{
  "livres": [
    {
      "id": 1,
      "nomLivre": "Livre javascript",
      "descriptionLivre": "JavaScript est un langage de programmation de scripts principalement employé dans les pages web interactives et à ce titre est une partie essentielle des applications web.",
      "prixLivre": 12.5,
      "imageLivre": "https://static.fnac-static.com/multimedia/Images/FR/NR/0d/4a/99/10045965/1507-1/tsp20181225081034/Tout-Javascript.jpg"
    },
    {
      "id": 2,
      "nomLivre": "Livre PHP",
      "descriptionLivre": "PHP: Hypertext Preprocessor, plus connu sous son sigle PHP, est un langage de programmation libre, principalement utilisé pour produire des pages Web dynamiques via un serveur HTTP.",
      "prixLivre": 45458.25,
      "imageLivre": "https://m.media-amazon.com/images/I/319uThTlOSL.jpg"
    },
    {
      "id": 3,
      "nomLivre": "Livre Python",
      "descriptionLivre": "Python est un langage de programmation interprété, multi-paradigme et multiplateformes. Il favorise la programmation impérative structurée, fonctionnelle et orientée objet.",
      "prixLivre": 142.35,
      "imageLivre": "https://www.dunod.com/sites/default/files/styles/principal_desktop/public/thumbnails/image/9782100804832-001-X.jpeg"
    },
    {
      "id": 4,
      "nomLivre": "Livre JAVA EE",
      "descriptionLivre": "Java SE Jakarta EE Java ME JavaFX Java Card Jakarta EE, est une spécification pour la plate-forme Java d'Oracle, destinée aux applications d'entreprise.",
      "prixLivre": 653.52,
      "imageLivre": "https://images-na.ssl-images-amazon.com/images/I/51vifBnNFzL.jpg"
    },
    {
      "nomLivre": "Livre jQuery",
      "descriptionLivre": "jQuery est une bibliothèque JavaScript libre et multiplateforme créée pour faciliter l'écriture de scripts côté client dans le code HTML des pages web. La première version est lancée en janvier 2006 par John Resig",
      "prixLivre": "45.25",
      "imageLivre": "https://images-na.ssl-images-amazon.com/images/I/518iI-gevyL.jpg",
      "id": 5
    },
    {
      "nomLivre": "Livre Unity",
      "descriptionLivre": "Unity est un moteur de jeu multiplateforme développé par Unity Technologies. Il est l'un des plus répandus dans l'industrie du jeu vidéo, aussi bien pour les grands studios que pour les indépendants du fait de sa rapidité aux prototypages et qu'il permet de sortir les jeux sur tous les supports.",
      "prixLivre": "35.25",
      "imageLivre": "https://www.d-booker.fr/399-thickbox/jeux-2d-et-multijoueurs-2e.jpg",
      "id": 6
    }
  ]
}